"""

코드를 짜다의 유래
진짜 코드를 베짜듯 코드를 실처럼 가느다란 것으로 짰기때문

버그를 잡다 유래
실제로 옛날에 날벌레때문에 오류를 일으킨적이 있음
그래서 오류를 일으키면 버그라고 하였음

패치의 유래
실제 프로그램 수정을 패치를 덧붙여서 수정했기 때문

구글 이스터에그
"do a barrel roll" → 검색하면 화면이 한 바퀴 회전함.
"askew" → 화면이 살짝 기울어짐.

애플 로고의 유래?
앨런튜링의 청산가리가 든 사과
bit와 byte의 용량단위와 bite의 베어물다 비슷해서
사실 아무 의미 없음

메가바이트는 사실 잘못알고있던것
8비트 => 1바이트
1024바이트(2의10승바이트) => 1키비바이트
1024키비바이트(2의20승바이트) => 1메비바이트
1024메비바이트(2의30승바이트) => 1기비바이트
1024기비바이트(2의40승바이트) => 1테비바이트

1000바이트 => 1킬로바이트
1000킬로바이트(1000의2승바이트) => 1메가바이트
1000메가바이트(1000의3승바이트) => 1기가바이트
1000기가바이트(1000의4승바이트) => 1테라바이트

이 뒤로는 페타바이트 엑사바이트 제타바이트 요타바이트 등 더 있는데
영화 아바타가 1PB이고 아바타2가 18.5PB이다.
뇌과학에서 인간의 뇌용량이 2.5PB정도라고 한다.
네이버가 2023년에 세종시에 세운 데이터센터가 65EB이다.
2025년도에는 인류가 생산한 정보의 양이 YB에 도달할거라 예 => 1조테라바이트

"""